# pandas入门

pandas含有使数据分析工作变得更快更简单的高级数据结构和操作工具。人们常常有以下需求：
- 具备按轴自动或显式数据对其功能的数据结构。这可以防止许多由于数据未对齐以及来自不同数据源（索引方式不同）的数据而导致的常见错误
- 集成时间序列功能
- 既能处理时间序列数据也能处理非时间序列数据的数据结构
- 数学运算和约简（比如对某个轴求和）可以根据不同的元数据（轴编号）执行
- 灵活处理缺失数据
- 合并及其他出现在常见数据库（例如基于SQL的）中的关系型运算

本章的学习要点：
1. pandas的数据结构（Series和DataFrame）
2. 索引对象
3. pandas基本功能
4. 汇总和计算描述统计
5. 处理缺失数据
6. 层次化索引

In [1]:
%matplotlib inline

In [2]:
import numpy as np #约定numpy为np

In [3]:
from pandas import Series, DataFrame #导入Series和DataFrame

In [4]:
import pandas as pd #约定pandas为pd

## 1. pandas的数据结构

### 1.1 Series
类似于一维数组的对象，由一组数据和数据对应的标签（索引）组成。

In [5]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values #获取数组表示形式

array([ 4,  7, -5,  3])

In [8]:
obj.index #获取数组索引对象

RangeIndex(start=0, stop=4, step=1)

数据索引可以修改为其他类型

In [9]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2['a'] #通过索引方式选取Series中单个值

-5

In [14]:
obj2['d'] = 6

In [15]:
obj2[['c', 'a', 'd']] #通过索引方式选取Series中一组值

c    3
a   -5
d    6
dtype: int64

In [16]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [403]:
obj2[obj2 > 0] #可用布尔型数组过滤

d    6
b    7
c    3
dtype: int64

In [17]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [18]:
obj2 * 2 #标量乘法

d    12
b    14
a   -10
c     6
dtype: int64

In [20]:
np.exp(obj2) #应用数学函数

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [21]:
'b' in obj2 #b索引是否在Series中

True

In [22]:
'e' in obj2 #e索引是否在Series中

False

用字典创建Series

In [24]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [25]:
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

指定的索引与字典索引不匹配时如何处理？

In [27]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [29]:
obj4 = Series(sdata, index=states) #找不到的索引设置为NaN
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

inull和notnull判断元素是否为空

In [30]:
pd.isnull(obj4) #是NaN返回True

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [31]:
pd.notnull(obj4) #不是NaN返回True

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [32]:
obj4.isnull() #是NaN返回True

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

算术运算自动对齐索引

In [33]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [34]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [36]:
obj3 + obj4 #自动对其不同索引数据

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

name和index.name的区别

In [37]:
obj4.name = 'population' #修改Series的name

In [38]:
obj4.index.name = 'state' #修改index的name
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

直接替代索引

In [39]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 1.2 DataFrame
一种表格型数据结构，包含有一组有序的列，不同列可以是不同的值类型（同一列必须是相同类型）。DataFrame既有行索引也有列索引，可以看做由Series组成的字典（每列一个Series）。

In [40]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data) #不指定序列默认排序

In [41]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [42]:
DataFrame(data, columns=['year', 'state', 'pop']) #指定序列按序列排

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [43]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
    index=['one', 'two', 'three', 'four', 'five']) #指定索引
frame2 #传入列在数据中找不到就产生NaN

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [44]:
frame2.columns #列名

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
frame2['state'] #获取指定列

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [47]:
frame2.year #获取指定列

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [48]:
frame2.loc['three'] #找到对应行，用ix有警告

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [49]:
frame2.loc['three'] #用loc不会有上面的警告,iloc用于数值索引

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [51]:
frame2['debt'] = 16.5 #设置debt列全部为16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [52]:
frame2['debt'] = np.arange(5.) #设置debt列为0-4的值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

用Series设置debt列

In [53]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [54]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

创建新列，新列内容为frame2.state=='Ohio'的布尔值

In [56]:
frame2['eastern'] = (frame2.state == 'Ohio')
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [57]:
del frame2['eastern'] #删除列

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

用嵌套字典（字典中包含字典）创建DataFrame

In [59]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [60]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [61]:
frame3.T #对列进行转置

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [63]:
DataFrame(pop, index=[2001, 2002, 2003])#创建，并用替换索引

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

取出子列，再构成DataFrame

In [64]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

DataFrame的构造函数可选参数如下：

![可以输入给DataFrame构造器的数据](可以输入给DataFrame构造器的数据.png)

设置index.name和columns.name

In [65]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [66]:
frame3.values #以而为ndarray形式返回DataFrame数据

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [67]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

## 2.索引对象
Series的index属性就是索引对象

In [70]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [71]:
index[1:]

Index(['b', 'c'], dtype='object')

In [72]:
index[1] = 'd' #index对象无法修改

TypeError: Index does not support mutable operations

In [73]:
index = pd.Index(np.arange(3)) #用Index构造函数生成索引对象
obj2 = pd.Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

Pandas中主要的Index对象包括：

![pandas中主要的Index对象](pandas中主要的Index对象.png)

In [74]:
frame3 #前面构造的DataFrame对象

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [450]:
'Ohio' in frame3.columns #Ohio在列中吗？

True

In [75]:
2003 in frame3.index #2003在索引中吗？

False

Index对象的方法和属性。**注意：通过Series和DataFrame获取的index对象是不能做“写”操作的。**

![Index的方法和属性](Index的方法和属性.png)

## 3. pandas基本功能

### 3.1重新索引

In [77]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [78]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) #reindex()会根据新索引重排，某个当前索引值不存在，引入NaN
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [79]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) #索引不存在对于值，插入0.0

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [80]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill') #method='ffill'实现前向值填充

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

![reindex的（插值）method选项](reindex的（插值）method选项.png)

In [81]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [82]:
frame2 = frame.reindex(['a', 'b', 'c', 'd']) #行索引reindex
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [83]:
states = ['Texas', 'Utah', 'California'] #列索引reindex
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [84]:
frame=frame.reindex(index=['a', 'b', 'c', 'd'])
frame
#frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)
#书上说同时对行列进行重新索引，插值只按行应用，但是运行不了
#后面分开又可以

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [86]:
frame=frame.reindex(method='ffill')
frame

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [87]:
frame=frame.reindex(columns=states)
frame

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [88]:
#frame.ix[['a', 'b', 'c', 'd'], states]按照书上的写法会得到警告
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

reindex函数支持的参数如下：

![reindex函数的参数](reindex函数的参数.png)

### 3.2丢弃指定轴上的项

In [89]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c') #删除c索引对应的行
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [90]:
obj.drop(['d', 'c']) #删除d、c行

a    0.0
b    1.0
e    4.0
dtype: float64

In [91]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Ohio']) #删除'Colorado'、'Ohio'行

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
data.drop('two', axis=1) #axis=1表示列,axis=0表示行

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [93]:
data.drop(['two', 'four'], axis='columns') #效果与上面相同

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### 3.3索引，选取和过滤

In [94]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b'] #选择b行（Series的每行只有一个元素）

1.0

In [95]:
obj[1] #b行也是第1行

1.0

In [96]:
obj[2:4] #2-3行

c    2.0
d    3.0
dtype: float64

In [97]:
obj[['b', 'a', 'd']] #b、a、d行

b    1.0
a    0.0
d    3.0
dtype: float64

In [98]:
obj[[1, 3]] #1（b）、3（d）行

b    1.0
d    3.0
dtype: float64

In [99]:
obj[obj < 2] #值小于2的行

a    0.0
b    1.0
dtype: float64

In [100]:
obj['b':'c'] #b-c行

b    1.0
c    2.0
dtype: float64

In [101]:
obj['b':'c'] = 5 #b-c行修改为5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [102]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data['two'] #取two列

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [478]:
data.two #取two列

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [104]:
data['Ohio'] #不能这样取Ohio行

KeyError: 'Ohio'

In [105]:
data.loc['Ohio'] #取Ohio行的正确方法

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int64

In [106]:
data.iloc[0] #Ohio行是第0行

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int64

In [107]:
data.loc['Ohio']['two'] #第Ohio行第two列

1

In [108]:
data[['three', 'one']] #取three、one列

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [109]:
data[:2] #0-1行，注意不是列！

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [110]:
data[0:1] #第1行，直接用data[0]会出错

      one  two  three  four
Ohio    0    1      2     3

In [111]:
data[data['three'] > 5] #three列大于5的数据

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data < 5 #bool值DataFrame

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [113]:
data[data < 5] = 0 #值小于5的数据
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [114]:
#data.ix['Colorado', ['two', 'three']]
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [115]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [116]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [117]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [118]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

新版本请用loc或者iloc替换ix

![DataFrame的索引选项](DataFrame的索引选项.png)

### 3.4算术运算和数据对齐
对象运算时，如果存在不同的索引，结果的索引就是改索引对的并集。

In [119]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [120]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [121]:
s1 + s2 #自动数据对齐，不同的索引处填充NaN

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [122]:
s1*s2

a   -15.33
c    -9.00
d      NaN
e    -2.25
f      NaN
g      NaN
dtype: float64

In [123]:
s1/s2

a   -3.476190
c   -0.694444
d         NaN
e   -1.000000
f         NaN
g         NaN
dtype: float64

In [499]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [500]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [501]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### 3.5在算数方法中填充值

In [502]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan #1行b列填充为NaN
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [503]:
df2 #1行b列为NaN

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [504]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [505]:
df1.add(df2, fill_value=0) #引入fill_value=0使得找不到另一个对象时填充一个0相加

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [506]:
df1.reindex(columns=df2.columns, fill_value=0) #修改列名，找不到填充0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### 3.5DataFrame和Series之间的运算

In [507]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [508]:
arr[0]

array([0., 1., 2., 3.])

In [509]:
arr - arr[0] #所有元素减去arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [510]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0] #书上为ix，第0行构成Series
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [511]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [512]:
frame - series #每行减去第0行

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [513]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [514]:
frame + series2 #无法对齐的部分填充NaN

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [515]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [516]:
series3 #第d列

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [517]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [518]:
frame-series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [519]:
frame.sub(series3,axis=1) #与frame-series3等价

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

+-*/等价的算术方法如下：
![算术方法](算术方法.png)

## 3.6函数应用和映射

In [520]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.069098 -1.345121 -0.087259
Ohio    1.662163 -0.978050  0.104725
Texas   0.980413 -0.527298  0.293213
Oregon  0.459632 -0.947140 -0.648691

In [521]:
np.abs(frame) #取绝对值

               b         d         e
Utah    0.069098  1.345121  0.087259
Ohio    1.662163  0.978050  0.104725
Texas   0.980413  0.527298  0.293213
Oregon  0.459632  0.947140  0.648691

In [522]:
f = lambda x: x.max() - x.min() #定义一个lambda函数
frame.apply(f) #默认按列应用这个函数

b    1.731261
d    0.817822
e    0.941904
dtype: float64

In [523]:
frame.apply(f, axis=1) #按行来应用这个函数

Utah      1.276023
Ohio      2.640213
Texas     1.507712
Oregon    1.406772
dtype: float64

**注意：不要去记axis参数的效果，记也记不住，最好的方法是写代码做一下测试，看看到底想要的效果是axis=0，还是axis=1。测试一下就可以解决的问题，就别浪费脑细胞了！**

In [524]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.069098 -1.345121 -0.648691
max  1.662163 -0.527298  0.293213

In [525]:
format = lambda x: '%.2f' % x
frame.applymap(format) #得到浮点值格式化字符串

            b      d      e
Utah    -0.07  -1.35  -0.09
Ohio     1.66  -0.98   0.10
Texas    0.98  -0.53   0.29
Oregon   0.46  -0.95  -0.65

In [526]:
frame['e'].map(format)

Utah      -0.09
Ohio       0.10
Texas      0.29
Oregon    -0.65
Name: e, dtype: object

## 3.7排序（sort）和排名（rank）

### 3.7.1按照行列索引进行排序
**注意：不是按照行列的值进行排序**

In [527]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index() #将index排序，并返回

a    1
b    2
c    3
d    0
dtype: int64

In [528]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index() #按index排序

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [529]:
frame.sort_index(axis=1) #按column排序

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [530]:
frame.sort_index(axis=1, ascending=False) #列索引降序

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 3.7.2按行列值排序

In [531]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values() #按值排序
#使用书上的order()会报错

2   -3
3    2
0    4
1    7
dtype: int64

In [532]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [533]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [534]:
frame.sort_values(by='b')#按b的值排序
#使用frame.sort_index(by='b') 有警告

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [535]:
frame.sort_values(by=['a', 'b']) #按多个列排序

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

### 3.7.3排名

根据排序关系，为每个数据分配一个排名值。

In [536]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() #排名

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [537]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [538]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [539]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [540]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

![排名时用于破坏平级关系的选项](排名时用于破坏平级关系的选项.png)

### 3.7.4 argsort

In [541]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [542]:
obj.argsort() #0号位是obj[1],1号位是obj[5]以此类推

0    1
1    5
2    4
3    3
4    6
5    0
6    2
dtype: int64

## 3.8带有重复值的轴索引

In [543]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [544]:
obj.index.is_unique #看index值是否是唯一的

False

In [545]:
obj['a'] #对应多个值会返回多个值

a    0
a    1
dtype: int64

In [546]:
obj['c']

4

In [547]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.127604  1.229962  0.223708
a -0.656618  0.342305 -1.092265
b  0.806029  0.422388 -0.805279
b -0.611721  0.005710  1.212894

In [548]:
df.loc['b']

          0         1         2
b  0.806029  0.422388 -0.805279
b -0.611721  0.005710  1.212894

**注意：重复索引通常在数据预处理时予以移除，例如用reindex移除。**

## 4.汇总和计算描述统计
### 4.1常用统计方法

In [549]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [550]:
df.sum() #返回一个含有列小计的Series

one    9.25
two   -5.80
dtype: float64

In [551]:
df.sum(axis=1) #按行求和运算，NaN当0来计算

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [552]:
df.mean(axis=1, skipna=False) #skipna=False使得遇到NaN，不管另一个数直接结果为NaN

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

![约简方法的选项](约简方法的选项.png)

In [553]:
df.idxmax() #间接统计，比如返回最大值的索引

one    b
two    d
dtype: object

In [554]:
df.cumsum() #上一行的结果累积加到下一行

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [555]:
df.describe() #一次性产生多个汇总统计

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [556]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe() #非数值型产生多个另一种汇总统计

count     16
unique     3
top        a
freq       8
dtype: object

![描述和汇总统计](描述和汇总统计.png)

### 4.2相关系数与协方差
以下程序需要访问iex的股票数据(Yahoo的数据访问有问题），因此需要联网，并确保安装了相应的网络访问模块。书上的pandas.io.data模块已经移动到模块pandas_datareader，若使用pip包管理器，请使用pip3 install pandas_datareader安装此模块。

In [557]:
from pandas_datareader import DataReader #注意：此后代码与书上有区别
from datetime import datetime
all_data={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    #若无法获取数据，请将iex改为其他股票数据提供者
    all_data[ticker]=DataReader(ticker,'iex',datetime(2018,1,1),datetime(2018,9,1))
all_data

1y
1y
1y
1y

{'AAPL':                 open      high       low     close    volume
 date
 2018-01-02  168.2280  170.3437  167.3382  170.3042  25555934
 2018-01-03  170.5711  172.5682  170.0076  170.2745  29517899
 2018-01-04  170.5810  171.5005  170.1262  171.0654  22434597
 2018-01-05  171.4708  173.3789  171.0852  173.0131  23660018
 2018-01-08  172.3705  173.6162  171.9552  172.3705  20567766
 2018-01-09  172.5682  173.0724  171.4411  172.3507  21583997
 2018-01-10  171.1940  172.3210  171.0358  172.3111  23959895
 2018-01-11  172.6077  173.4961  172.5089  173.2899  18667729
 2018-01-12  174.1797  175.3463  173.6557  175.0794  25418080
 2018-01-16  175.8802  177.3532  174.1401  174.1896  29565947
 2018-01-17  174.1500  177.2148  173.0823  177.0665  34386836
 2018-01-18  177.3335  178.0552  176.2262  177.2247  31193352
 2018-01-19  176.5821  177.5411  175.3957  176.4338  32425067
 2018-01-22  175.2870  175.7615  174.5965  174.9904  27108551
 2018-01-23  175.2870  177.4027  174.8124  175.0299  32689146
 2018-01-24  175.2375  175.2870  171.2335  172.2419  51105090
 2018-01-25  172.5237  172.9636  168.5938  169.1672  41529004
 2018-01-26  170.0471  170.0471  168.1292  169.5627  39143011
 2018-01-29  168.2280  168.2280  165.1731  166.0530  50640406
 2018-01-30  163.6457  165.4697  162.8300  165.0743  46048185
 2018-01-31  164.9754  166.5292  164.6096  165.5290  32478930
 2018-02-01  165.2670  166.7055  164.8666  165.8751  47230787
 2018-02-02  164.1153  164.9062  158.2823  158.6777  86593825
 2018-02-05  157.2936  162.0193  154.2288  154.7132  72738522
 2018-02-06  153.0721  161.8611  152.2515  161.1790  68243838
 2018-02-07  161.2334  161.5448  157.2625  157.7286  51608580
 2018-02-08  158.4701  159.1720  153.2698  153.3885  54390516
 2018-02-09  155.9198  156.7338  149.1399  155.2647  70672608
 2018-02-12  157.3394  162.6899  156.3566  161.5185  60819539
 2018-02-13  160.7641  163.5436  160.4663  163.1366  32549163
 ...              ...       ...       ...       ...       ...
 2018-07-23  190.0136  191.2891  188.8975  190.9403  15989365
 2018-07-24  191.7774  192.9833  191.3788  192.3255  18697898
 2018-07-25  192.3855  194.1690  191.7575  194.1391  16826483
 2018-07-26  193.9298  195.2751  192.9333  193.5312  19075964
 2018-07-27  194.3085  194.5078  189.4356  190.3125  24023972
 2018-07-30  191.2293  191.5283  188.4092  189.2463  21029535
 2018-07-31  189.6349  191.4685  188.6783  189.6249  39373038
 2018-08-01  198.4340  201.0548  196.6204  200.7958  67935716
 2018-08-02  199.8790  207.6517  199.6498  206.6652  62404012
 2018-08-03  206.3064  208.0105  204.7621  207.2631  33447396
 2018-08-06  207.2730  208.5187  206.3463  208.3393  25425387
 2018-08-07  208.5884  208.7678  206.0374  206.3862  25587387
 2018-08-08  205.3299  207.0837  203.8052  206.5257  22525487
 2018-08-09  206.5556  209.0468  206.4758  208.1500  23492626
 2018-08-10  207.3600  209.1000  206.6700  207.5300  24611202
 2018-08-13  207.7000  210.9520  207.7000  208.8700  25890880
 2018-08-14  210.1550  210.5600  208.2600  209.7500  20748010
 2018-08-15  209.2200  210.7400  208.3300  210.2400  28807564
 2018-08-16  211.7500  213.8121  211.4700  213.3200  28500367
 2018-08-17  213.4400  217.9500  213.1600  217.5800  35426997
 2018-08-20  218.1000  219.1800  215.1100  215.4600  30287695
 2018-08-21  216.8000  217.1900  214.0250  215.0400  26159755
 2018-08-22  214.1000  216.3600  213.8400  215.0500  19018131
 2018-08-23  214.6500  217.0500  214.6000  215.4900  18883224
 2018-08-24  216.6000  216.9000  215.1100  216.1600  18476356
 2018-08-27  217.1500  218.7400  216.3300  217.9400  20525117
 2018-08-28  219.0100  220.5400  218.9200  219.7000  22776766
 2018-08-29  220.1500  223.4900  219.4100  222.9800  27254804
 2018-08-30  223.2500  228.2600  222.4000  225.0300  48793824
 2018-08-31  226.5100  228.8700  226.0000  227.6300  43340134

 [169 rows x 5 columns],
 'GOOG':                open     high      low    close   volume
 date
 2018-01-02  1048.34  1066.94  1045.23  1065.00  1237564
 2018-01-03  1064.31  1086.29  1063.21  1082.48  1430170
 2018-01-04  1088.00  1093.57  1084.00  1086.40  1004605
 2018-01-05  1094.00  1104.25  1092.00  1102.23  1279123
 2018-01-08  1102.23  1111.27  1101.62  1106.94  1047603
 2018-01-09  1109.40  1110.57  1101.23  1106.26   902541
 2018-01-10  1097.10  1104.60  1096.11  1102.61  1042793
 2018-01-11  1106.30  1106.53  1099.59  1105.52   978292
 2018-01-12  1102.41  1124.29  1101.15  1122.26  1720533
 2018-01-16  1132.51  1139.91  1117.83  1121.76  1575261
 2018-01-17  1126.22  1132.60  1117.01  1131.98  1202639
 2018-01-18  1131.41  1132.51  1117.50  1129.79  1198234
 2018-01-19  1131.83  1137.86  1128.30  1137.51  1778229
 2018-01-22  1137.49  1159.88  1135.11  1155.81  1617975
 2018-01-23  1159.85  1171.63  1158.75  1169.97  1333056
 2018-01-24  1177.33  1179.86  1161.05  1164.24  1416625
 2018-01-25  1172.53  1175.94  1162.76  1170.37  1480540
 2018-01-26  1175.08  1175.84  1158.11  1175.84  2018755
 2018-01-29  1176.48  1186.89  1171.98  1175.58  1378913
 2018-01-30  1167.83  1176.52  1163.52  1163.69  1556346
 2018-01-31  1170.57  1173.00  1159.13  1169.94  1538688
 2018-02-01  1162.61  1174.00  1157.52  1167.70  2412114
 2018-02-02  1122.00  1123.07  1107.28  1111.90  4857943
 2018-02-05  1090.60  1110.00  1052.03  1055.80  3798301
 2018-02-06  1027.18  1081.71  1023.14  1080.60  3447956
 2018-02-07  1081.54  1081.78  1048.26  1048.58  2369232
 2018-02-08  1055.41  1058.62  1000.66  1001.52  2859136
 2018-02-09  1017.25  1043.97   992.56  1037.78  3505862
 2018-02-12  1048.00  1061.50  1040.93  1051.94  2057718
 2018-02-13  1045.00  1058.37  1044.09  1052.10  1265054
 ...             ...      ...      ...      ...      ...
 2018-07-23  1181.01  1206.49  1181.00  1205.50  2619234
 2018-07-24  1262.59  1266.00  1235.56  1248.08  3318204
 2018-07-25  1239.13  1265.86  1239.13  1263.70  2139999
 2018-07-26  1251.00  1269.77  1249.02  1268.33  2405638
 2018-07-27  1271.00  1273.89  1231.00  1238.50  2130558
 2018-07-30  1228.01  1234.92  1211.47  1219.74  1849904
 2018-07-31  1220.01  1227.59  1205.60  1217.26  1644722
 2018-08-01  1228.00  1233.47  1210.21  1220.01  1567264
 2018-08-02  1205.90  1229.88  1204.79  1226.15  1531299
 2018-08-03  1229.62  1230.00  1215.06  1223.71  1089896
 2018-08-06  1225.00  1226.09  1215.80  1224.77  1081723
 2018-08-07  1237.00  1251.17  1236.17  1242.22  1493980
 2018-08-08  1240.47  1256.50  1238.01  1245.61  1370913
 2018-08-09  1249.90  1255.54  1246.01  1249.10   848601
 2018-08-10  1243.00  1245.69  1232.00  1237.61  1108919
 2018-08-13  1236.98  1249.27  1233.64  1235.01   997346
 2018-08-14  1235.19  1245.87  1225.11  1242.10  1348194
 2018-08-15  1229.26  1235.24  1209.51  1214.38  1828814
 2018-08-16  1224.73  1226.00  1202.55  1206.49  1343161
 2018-08-17  1202.03  1209.02  1188.24  1200.96  1389645
 2018-08-20  1205.02  1211.00  1194.63  1207.77   870772
 2018-08-21  1208.00  1217.26  1200.35  1201.62  1205580
 2018-08-22  1200.00  1211.84  1199.00  1207.33   887389
 2018-08-23  1207.14  1221.28  1204.24  1205.38   992604
 2018-08-24  1208.82  1221.65  1206.36  1220.65   946840
 2018-08-27  1227.60  1243.09  1225.72  1241.82  1156255
 2018-08-28  1241.29  1242.55  1228.69  1231.15  1304007
 2018-08-29  1237.45  1250.66  1236.36  1249.30  1309312
 2018-08-30  1244.23  1253.63  1232.59  1239.12  1331439
 2018-08-31  1234.98  1238.66  1211.29  1218.19  1816426

 [169 rows x 5 columns],
 'IBM':                 open      high       low     close    volume
 date
 2018-01-02  149.6967  149.9970  148.7665  149.4544   4202503
 2018-01-03  152.4484  154.8416  151.4698  153.5626   9441567
 2018-01-04  154.6866  157.2771  154.4153  156.6728   7556249
 2018-01-05  157.3898  157.8355  156.0924  157.4383   5195764
 2018-01-08  157.6030  158.8093  156.6738  158.3878   5237523
 2018-01-09  158.8044  159.4148  157.9905  158.7366   4341810
 2018-01-10  157.8452  159.2211  157.4479  159.0757   4174105
 2018-01-11  159.6764  159.8121  158.2231  159.0951   3794453
 2018-01-12  158.9207  159.6183  157.9615  158.0681   5031886
 2018-01-16  159.9671  160.1512  158.2715  158.7560   7794195
 2018-01-17  162.7866  163.8673  162.0600  163.4067  11710033
 2018-01-18  164.7148  165.8096  162.9223  163.8621  14259345
 2018-01-19  159.3470  160.2578  156.2853  157.3220  21172488
 2018-01-22  156.4887  158.8819  156.1012  157.5448   8480795
 2018-01-23  157.7580  161.0911  157.4576  161.0814   7466232
 2018-01-24  161.5658  163.4746  159.6958  160.2287   5645003
 2018-01-25  160.7519  161.5949  160.0543  160.3256   3302520
 2018-01-26  160.9554  162.2094  160.6357  162.1375   3787913
 2018-01-29  162.2441  163.1548  160.8488  161.6143   3516995
 2018-01-30  161.0426  161.5852  158.0826  158.5331   4902341
 2018-01-31  158.6591  159.8605  157.7008  158.6106   4072830
 2018-02-01  158.1165  159.0273  156.8666  157.3511   4434242
 2018-02-02  156.6728  156.9635  153.9272  154.0858   5251938
 2018-02-05  152.9813  153.5723  145.3366  147.7879   8746599
 2018-02-06  145.6176  150.6559  144.4742  150.5105   9867678
 2018-02-07  149.3769  150.5105  148.5146  149.0669   6149207
 2018-02-08  149.1941  149.8595  144.3214  144.4095   6779095
 2018-02-09  145.3977  147.2959  141.2838  146.2881   7828290
 2018-02-12  147.6482  149.1158  147.0611  148.1374   5881377
 2018-02-13  147.6482  147.9211  146.4153  147.5014   4891010
 ...              ...       ...       ...       ...       ...
 2018-07-23  144.7858  145.1321  143.4651  144.1428   3897892
 2018-07-24  145.1321  145.4684  144.3604  144.8155   3891625
 2018-07-25  144.4494  145.0826  143.9449  145.0529   3623182
 2018-07-26  145.8543  147.6746  145.0628  145.1420   4778022
 2018-07-27  145.3200  145.5674  143.1139  143.5986   3749642
 2018-07-30  143.2524  144.6770  143.1436  143.9350   3608283
 2018-07-31  144.1823  144.2417  142.6182  143.3810   5474478
 2018-08-01  143.2128  143.6382  141.8080  141.9663   3388386
 2018-08-02  141.3331  141.8278  140.8088  141.4320   3841447
 2018-08-03  141.7091  146.3390  141.4716  146.1214   8053567
 2018-08-06  145.3794  145.6267  144.0141  144.4692   3913743
 2018-08-07  145.0826  146.0620  144.7858  145.4388   3508758
 2018-08-08  145.7553  145.8543  144.6770  145.3200   3581746
 2018-08-09  145.5300  145.9400  144.7300  144.7700   3093504
 2018-08-10  144.5000  145.0700  143.8800  144.4800   3003158
 2018-08-13  144.1500  144.3000  142.5300  142.7100   2858842
 2018-08-14  143.0000  143.8200  142.9300  143.3600   2860041
 2018-08-15  142.5500  144.0000  142.0000  143.9100   4241496
 2018-08-16  144.3700  145.6800  144.3700  145.3400   5250878
 2018-08-17  144.7900  146.3900  144.6900  146.0600   2678820
 2018-08-20  146.3700  147.1600  146.1500  146.5100   2499654
 2018-08-21  147.0000  147.1200  145.8900  145.9700   3106876
 2018-08-22  146.0100  146.1600  145.1900  145.2400   2388961
 2018-08-23  145.0400  145.5200  144.7500  145.3700   2220603
 2018-08-24  145.4600  146.0869  144.8700  146.0400   2776813
 2018-08-27  146.9400  147.6200  146.5200  146.6900   3491565
 2018-08-28  146.9500  146.9900  146.1900  146.5900   2455328
 2018-08-29  146.8700  147.9300  146.6000  147.5400   3153845
 2018-08-30  147.0300  147.3000  145.2500  145.9300   3340369
 2018-08-31  145.7200  146.7800  145.5401  146.4800   3488476

 [169 rows x 5 columns],
 'MSFT':                 open      high       low     close    volume
 date
 2018-01-02   85.0251   85.2078   84.4081   84.8524  22483797
 2018-01-03   84.9560   85.4052   84.8721   85.2473  26061439
 2018-01-04   85.4842   86.5405   85.4645   85.9976  21911974
 2018-01-05   86.5405   87.2810   86.3135   87.0638  23407110
 2018-01-08   87.0736   87.4488   86.4859   87.1526  22113049
 2018-01-09   87.5179   87.5941   86.7380   87.0934  19484317
 2018-01-10   86.7380   87.0638   86.2937   86.6985  18652201
 2018-01-11   87.0045   87.0045   86.1259   86.9552  17808877
 2018-01-12   87.5376   88.6335   87.3205   88.4558  24271531
 2018-01-16   88.9494   89.6306   86.8865   87.2217  36599736
 2018-01-17   87.9424   89.1271   87.6166   88.9889  25621164
 2018-01-18   88.6532   89.5121   88.5150   88.9494  24159683
 2018-01-19   88.9889   89.4529   88.5150   88.8507  36875013
 2018-01-22   88.8507   90.4500   88.5940   90.4401  23601555
 2018-01-23   90.7264   91.1213   90.3710   90.7264  23412841
 2018-01-24   91.3681   92.2369   90.4105   90.6474  33277483
 2018-01-25   91.2842   92.0493   90.7560   91.1509  26383238
 2018-01-26   91.9308   92.8588   91.3977   92.8588  29172167
 2018-01-29   93.9250   94.2311   92.5232   92.7206  31569940
 2018-01-30   92.1085   92.4639   90.9238   91.5557  38635053
 2018-01-31   92.5528   94.1817   92.3158   93.7967  48756338
 2018-02-01   93.5795   94.8431   92.3862   93.0563  47227882
 2018-02-02   92.4442   92.7700   90.3315   90.6079  47867753
 2018-02-05   89.4035   92.0493   86.8762   86.8762  51031465
 2018-02-06   85.7804   90.3068   84.1613   90.1637  67998564
 2018-02-07   89.3344   90.5981   88.0609   88.4656  41107592
 2018-02-08   88.5644   88.7273   83.6776   83.9244  55628657
 2018-02-09   85.1979   87.7943   82.7595   87.0539  63499065
 2018-02-12   87.6018   88.6335   86.8066   87.9918  35720341
 2018-02-13   87.7943   88.8507   86.6788   88.6828  26407702
 ...              ...       ...       ...       ...       ...
 2018-07-23  105.8924  107.7254  105.7231  107.5560  29706955
 2018-07-24  108.1537  108.4028  106.8488  107.2472  26316619
 2018-07-25  107.5411  110.7239  107.1875  110.4051  30798058
 2018-07-26  110.3154  110.5744  109.0802  109.1997  31372110
 2018-07-27  109.7576  109.7576  105.7331  107.2672  37005292
 2018-07-30  106.7790  107.1177  104.3584  104.9660  34668327
 2018-07-31  106.0817  106.3108  104.9760  105.6733  27655152
 2018-08-01  105.6235  106.0379  105.0158  105.8725  23628699
 2018-08-02  104.9959  107.6756  104.4380  107.1576  26104258
 2018-08-03  107.3867  107.6357  106.4105  107.6258  18659599
 2018-08-06  107.7055  108.0043  107.1466  107.7154  20265947
 2018-08-07  108.1438  108.6817  107.7553  108.4626  16080214
 2018-08-08  108.9108  109.3292  108.3429  109.0702  15487502
 2018-08-09  109.2894  109.7376  109.1798  109.2495  13677211
 2018-08-10  109.0005  109.2694  107.9645  108.5821  18183724
 2018-08-13  108.8212  109.1599  107.6855  107.7951  18474884
 2018-08-14  108.1438  109.3292  107.6258  109.1399  16788314
 2018-08-15  108.4900  108.9850  106.8200  107.6600  29982806
 2018-08-16  108.3000  108.8600  107.3000  107.6400  21384289
 2018-08-17  107.3600  107.9000  106.6900  107.5800  18061512
 2018-08-20  107.5100  107.9000  106.4800  106.8700  17914201
 2018-08-21  106.9200  107.3500  105.8500  105.9800  22881861
 2018-08-22  105.8500  107.3400  105.7800  107.0600  18000639
 2018-08-23  107.1500  108.1800  106.8700  107.5600  18167723
 2018-08-24  107.6700  108.5600  107.5600  108.4000  17234020
 2018-08-27  109.2700  109.6400  108.5100  109.6000  19662331
 2018-08-28  109.9400  110.5000  109.7900  110.2600  19151528
 2018-08-29  110.4500  112.0300  110.2700  112.0200  20818044
 2018-08-30  111.6700  112.6100  111.4400  111.9500  22798702
 2018-08-31  111.6850  112.7770  111.5150  112.3300  23222713

 [169 rows x 5 columns]}

In [558]:
price=DataFrame({key:all_data[key]['close'] for key in all_data.keys()})
price

                AAPL     GOOG       IBM      MSFT
date
2018-01-02  170.3042  1065.00  149.4544   84.8524
2018-01-03  170.2745  1082.48  153.5626   85.2473
2018-01-04  171.0654  1086.40  156.6728   85.9976
2018-01-05  173.0131  1102.23  157.4383   87.0638
2018-01-08  172.3705  1106.94  158.3878   87.1526
2018-01-09  172.3507  1106.26  158.7366   87.0934
2018-01-10  172.3111  1102.61  159.0757   86.6985
2018-01-11  173.2899  1105.52  159.0951   86.9552
2018-01-12  175.0794  1122.26  158.0681   88.4558
2018-01-16  174.1896  1121.76  158.7560   87.2217
2018-01-17  177.0665  1131.98  163.4067   88.9889
2018-01-18  177.2247  1129.79  163.8621   88.9494
2018-01-19  176.4338  1137.51  157.3220   88.8507
2018-01-22  174.9904  1155.81  157.5448   90.4401
2018-01-23  175.0299  1169.97  161.0814   90.7264
2018-01-24  172.2419  1164.24  160.2287   90.6474
2018-01-25  169.1672  1170.37  160.3256   91.1509
2018-01-26  169.5627  1175.84  162.1375   92.8588
2018-01-29  166.0530  1175.58  161.6143   92.7206
2018-01-30  165.0743  1163.69  158.5331   91.5557
2018-01-31  165.5290  1169.94  158.6106   93.7967
2018-02-01  165.8751  1167.70  157.3511   93.0563
2018-02-02  158.6777  1111.90  154.0858   90.6079
2018-02-05  154.7132  1055.80  147.7879   86.8762
2018-02-06  161.1790  1080.60  150.5105   90.1637
2018-02-07  157.7286  1048.58  149.0669   88.4656
2018-02-08  153.3885  1001.52  144.4095   83.9244
2018-02-09  155.2647  1037.78  146.2881   87.0539
2018-02-12  161.5185  1051.94  148.1374   87.9918
2018-02-13  163.1366  1052.10  147.5014   88.6828
...              ...      ...       ...       ...
2018-07-23  190.9403  1205.50  144.1428  107.5560
2018-07-24  192.3255  1248.08  144.8155  107.2472
2018-07-25  194.1391  1263.70  145.0529  110.4051
2018-07-26  193.5312  1268.33  145.1420  109.1997
2018-07-27  190.3125  1238.50  143.5986  107.2672
2018-07-30  189.2463  1219.74  143.9350  104.9660
2018-07-31  189.6249  1217.26  143.3810  105.6733
2018-08-01  200.7958  1220.01  141.9663  105.8725
2018-08-02  206.6652  1226.15  141.4320  107.1576
2018-08-03  207.2631  1223.71  146.1214  107.6258
2018-08-06  208.3393  1224.77  144.4692  107.7154
2018-08-07  206.3862  1242.22  145.4388  108.4626
2018-08-08  206.5257  1245.61  145.3200  109.0702
2018-08-09  208.1500  1249.10  144.7700  109.2495
2018-08-10  207.5300  1237.61  144.4800  108.5821
2018-08-13  208.8700  1235.01  142.7100  107.7951
2018-08-14  209.7500  1242.10  143.3600  109.1399
2018-08-15  210.2400  1214.38  143.9100  107.6600
2018-08-16  213.3200  1206.49  145.3400  107.6400
2018-08-17  217.5800  1200.96  146.0600  107.5800
2018-08-20  215.4600  1207.77  146.5100  106.8700
2018-08-21  215.0400  1201.62  145.9700  105.9800
2018-08-22  215.0500  1207.33  145.2400  107.0600
2018-08-23  215.4900  1205.38  145.3700  107.5600
2018-08-24  216.1600  1220.65  146.0400  108.4000
2018-08-27  217.9400  1241.82  146.6900  109.6000
2018-08-28  219.7000  1231.15  146.5900  110.2600
2018-08-29  222.9800  1249.30  147.5400  112.0200
2018-08-30  225.0300  1239.12  145.9300  111.9500
2018-08-31  227.6300  1218.19  146.4800  112.3300

[169 rows x 4 columns]

In [559]:
volume=DataFrame({key:all_data[key]['volume'] for key in all_data.keys()})
volume

                AAPL     GOOG       IBM      MSFT
date
2018-01-02  25555934  1237564   4202503  22483797
2018-01-03  29517899  1430170   9441567  26061439
2018-01-04  22434597  1004605   7556249  21911974
2018-01-05  23660018  1279123   5195764  23407110
2018-01-08  20567766  1047603   5237523  22113049
2018-01-09  21583997   902541   4341810  19484317
2018-01-10  23959895  1042793   4174105  18652201
2018-01-11  18667729   978292   3794453  17808877
2018-01-12  25418080  1720533   5031886  24271531
2018-01-16  29565947  1575261   7794195  36599736
2018-01-17  34386836  1202639  11710033  25621164
2018-01-18  31193352  1198234  14259345  24159683
2018-01-19  32425067  1778229  21172488  36875013
2018-01-22  27108551  1617975   8480795  23601555
2018-01-23  32689146  1333056   7466232  23412841
2018-01-24  51105090  1416625   5645003  33277483
2018-01-25  41529004  1480540   3302520  26383238
2018-01-26  39143011  2018755   3787913  29172167
2018-01-29  50640406  1378913   3516995  31569940
2018-01-30  46048185  1556346   4902341  38635053
2018-01-31  32478930  1538688   4072830  48756338
2018-02-01  47230787  2412114   4434242  47227882
2018-02-02  86593825  4857943   5251938  47867753
2018-02-05  72738522  3798301   8746599  51031465
2018-02-06  68243838  3447956   9867678  67998564
2018-02-07  51608580  2369232   6149207  41107592
2018-02-08  54390516  2859136   6779095  55628657
2018-02-09  70672608  3505862   7828290  63499065
2018-02-12  60819539  2057718   5881377  35720341
2018-02-13  32549163  1265054   4891010  26407702
...              ...      ...       ...       ...
2018-07-23  15989365  2619234   3897892  29706955
2018-07-24  18697898  3318204   3891625  26316619
2018-07-25  16826483  2139999   3623182  30798058
2018-07-26  19075964  2405638   4778022  31372110
2018-07-27  24023972  2130558   3749642  37005292
2018-07-30  21029535  1849904   3608283  34668327
2018-07-31  39373038  1644722   5474478  27655152
2018-08-01  67935716  1567264   3388386  23628699
2018-08-02  62404012  1531299   3841447  26104258
2018-08-03  33447396  1089896   8053567  18659599
2018-08-06  25425387  1081723   3913743  20265947
2018-08-07  25587387  1493980   3508758  16080214
2018-08-08  22525487  1370913   3581746  15487502
2018-08-09  23492626   848601   3093504  13677211
2018-08-10  24611202  1108919   3003158  18183724
2018-08-13  25890880   997346   2858842  18474884
2018-08-14  20748010  1348194   2860041  16788314
2018-08-15  28807564  1828814   4241496  29982806
2018-08-16  28500367  1343161   5250878  21384289
2018-08-17  35426997  1389645   2678820  18061512
2018-08-20  30287695   870772   2499654  17914201
2018-08-21  26159755  1205580   3106876  22881861
2018-08-22  19018131   887389   2388961  18000639
2018-08-23  18883224   992604   2220603  18167723
2018-08-24  18476356   946840   2776813  17234020
2018-08-27  20525117  1156255   3491565  19662331
2018-08-28  22776766  1304007   2455328  19151528
2018-08-29  27254804  1309312   3153845  20818044
2018-08-30  48793824  1331439   3340369  22798702
2018-08-31  43340134  1816426   3488476  23222713

[169 rows x 4 columns]

In [560]:
returns=price.pct_change() #价格的百分数变化
returns.tail()

                AAPL      GOOG       IBM      MSFT
date
2018-08-27  0.008235  0.017343  0.004451  0.011070
2018-08-28  0.008076 -0.008592 -0.000682  0.006022
2018-08-29  0.014929  0.014742  0.006481  0.015962
2018-08-30  0.009194 -0.008149 -0.010912 -0.000625
2018-08-31  0.011554 -0.016891  0.003769  0.003394

In [561]:
returns['MSFT'].corr(returns['IBM']) #相关系数

0.5522086305011801

In [562]:
returns['MSFT'].cov(returns['IBM']) #协方差

0.00011619445616532727

In [563]:
returns.corr() #相关系数矩阵

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.585631  0.440515  0.624769
GOOG  0.585631  1.000000  0.539292  0.804216
IBM   0.440515  0.539292  1.000000  0.552209
MSFT  0.624769  0.804216  0.552209  1.000000

In [564]:
returns.cov() #协方差矩阵

          AAPL      GOOG       IBM      MSFT
AAPL  0.000214  0.000138  0.000088  0.000141
GOOG  0.000138  0.000258  0.000119  0.000199
IBM   0.000088  0.000119  0.000187  0.000116
MSFT  0.000141  0.000199  0.000116  0.000237

In [565]:
returns.corrwith(returns.IBM)

AAPL    0.440515
GOOG    0.539292
IBM     1.000000
MSFT    0.552209
dtype: float64

In [566]:
returns.corrwith(volume)

AAPL    0.032873
GOOG   -0.251913
IBM    -0.185134
MSFT   -0.103549
dtype: float64

### 4.3唯一值，值计数以及成员资格

In [567]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [568]:
uniques = obj.unique() #得到Series中的唯一值数组
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [569]:
obj.value_counts() #计算Series中各值出现的频率

a    3
c    3
b    2
d    1
dtype: int64

In [570]:
pd.value_counts(obj.values, sort=False) #pandas的value_counts

c    3
b    2
a    3
d    1
dtype: int64

In [571]:
mask = obj.isin(['b', 'c']) #判断矢量化成员资格，选取Series或DataFrame中列数据子集
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [572]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

![成员资格方法](成员资格方法.png)

统计各列1-5出现的次数

In [573]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [574]:
result = data.apply(pd.value_counts).fillna(0) #统计出现次数，没有的用0填充
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 5.处理缺失数据

In [575]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [576]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [577]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

![NA处理方法](NA处理方法.png)

### 5.1滤除缺失数据

In [578]:
from numpy import nan as NA

In [579]:
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [580]:
data.dropna() #返回一个仅含非空数据和索引值的Series

0    1.0
2    3.5
4    7.0
dtype: float64

In [581]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [582]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [583]:
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [584]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [585]:
data.dropna(how='all') #只丢弃全为NaN的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [586]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [587]:
data.dropna(axis=1, how='all') #只丢弃全为NaN的列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [588]:
df = DataFrame(np.random.randn(7, 3))

In [589]:
df.iloc[:4, 1] = NA; df.iloc[:2, 2] = NA
df

          0         1         2
0  0.919586       NaN       NaN
1 -0.484203       NaN       NaN
2 -0.498003       NaN -0.187733
3 -0.962620       NaN -0.612956
4 -2.099343  0.656880  0.469546
5 -0.485536  0.440132  0.468751
6  1.523735  0.314507 -2.468055

In [590]:
df.dropna(thresh=2) #书上是3，这里是留下非NaN参数个数大于等于thresh参数的行

          0         1         2
2 -0.498003       NaN -0.187733
3 -0.962620       NaN -0.612956
4 -2.099343  0.656880  0.469546
5 -0.485536  0.440132  0.468751
6  1.523735  0.314507 -2.468055

### 5.2填充缺失数据

In [591]:
df

          0         1         2
0  0.919586       NaN       NaN
1 -0.484203       NaN       NaN
2 -0.498003       NaN -0.187733
3 -0.962620       NaN -0.612956
4 -2.099343  0.656880  0.469546
5 -0.485536  0.440132  0.468751
6  1.523735  0.314507 -2.468055

In [592]:
df.fillna(0) #将缺失值替换为fillna()里面的常数值

          0         1         2
0  0.919586  0.000000  0.000000
1 -0.484203  0.000000  0.000000
2 -0.498003  0.000000 -0.187733
3 -0.962620  0.000000 -0.612956
4 -2.099343  0.656880  0.469546
5 -0.485536  0.440132  0.468751
6  1.523735  0.314507 -2.468055

In [593]:
df.fillna({1: 0.5, 3: -1}) #不同列填充不同值

          0         1         2
0  0.919586  0.500000       NaN
1 -0.484203  0.500000       NaN
2 -0.498003  0.500000 -0.187733
3 -0.962620  0.500000 -0.612956
4 -2.099343  0.656880  0.469546
5 -0.485536  0.440132  0.468751
6  1.523735  0.314507 -2.468055

In [594]:
df = DataFrame(np.random.randn(6, 3))

In [595]:
df.iloc[2:, 1] = NA; df.iloc[4:, 2] = NA
df

          0         1         2
0  0.230532  0.137186 -0.589502
1  0.114934  1.541941  0.582744
2  0.255699       NaN -1.135038
3 -0.089509       NaN  0.174168
4 -1.442999       NaN       NaN
5 -0.100739       NaN       NaN

In [596]:
df.fillna(method='ffill') #reindex有效的插值方法也可以用于fillna

          0         1         2
0  0.230532  0.137186 -0.589502
1  0.114934  1.541941  0.582744
2  0.255699  1.541941 -1.135038
3 -0.089509  1.541941  0.174168
4 -1.442999  1.541941  0.174168
5 -0.100739  1.541941  0.174168

In [597]:
df.fillna(method='ffill', limit=2) #只往下填充两行

          0         1         2
0  0.230532  0.137186 -0.589502
1  0.114934  1.541941  0.582744
2  0.255699  1.541941 -1.135038
3 -0.089509  1.541941  0.174168
4 -1.442999       NaN  0.174168
5 -0.100739       NaN  0.174168

In [598]:
data = Series([1., NA, 3.5, NA, 7])

In [599]:
data.fillna(data.mean()) #用均值填充

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

![fillna函数的参数](fillna函数的参数.png)

## 6.层次化索引
层次化索引使用起来并不方便，应该尽量将层次化索引转换为单级索引。

In [600]:
data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.453807
   2    0.215529
   3    0.853281
b  1    0.528782
   2    0.123836
   3   -0.237950
c  1    1.209237
   2    0.761991
d  2    1.994820
   3    0.841073
dtype: float64

In [601]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [602]:
data['b']

1    0.528782
2    0.123836
3   -0.237950
dtype: float64

In [603]:
data['b':'c']

b  1    0.528782
   2    0.123836
   3   -0.237950
c  1    1.209237
   2    0.761991
dtype: float64

In [604]:
data.loc[['b', 'd']]

b  1    0.528782
   2    0.123836
   3   -0.237950
d  2    1.994820
   3    0.841073
dtype: float64

In [605]:
data[:, 2] #返回每个索引对应的第二个元素

a    0.215529
b    0.123836
c    0.761991
d    1.994820
dtype: float64

In [606]:
data.unstack() #使其从Series变为DataFrame

          1         2         3
a -0.453807  0.215529  0.853281
b  0.528782  0.123836 -0.237950
c  1.209237  0.761991       NaN
d       NaN  1.994820  0.841073

In [607]:
data.unstack().stack() #stack()是unstack()的逆运算

a  1   -0.453807
   2    0.215529
   3    0.853281
b  1    0.528782
   2    0.123836
   3   -0.237950
c  1    1.209237
   2    0.761991
d  2    1.994820
   3    0.841073
dtype: float64

In [608]:
frame = DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], columns=[['Ohio', 'Ohio', 'Colorado'],
['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [609]:
frame.index.names = ['key1', 'key2'] #给index添加名字

In [610]:
frame.columns.names = ['state', 'color'] #给columns添加名字
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [611]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [612]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### 6.1重排分级顺序

In [613]:
frame.swaplevel('key1', 'key2') #调整两个级别索引的编号或名称

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [614]:
frame.sort_index(1) #根据单级别的值排序，如key2的1，2

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [615]:
frame.swaplevel(0, 1).sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 6.2根据级别汇总

In [616]:
frame.sum(level='key2') #根据某个级别（一样的加起来）汇总求和

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [617]:
frame.sum(level='color', axis=1) #按行根据某个级别汇总

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 6.3使用DataFrame的列

In [618]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                            'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                            'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [619]:
frame2 = frame.set_index(['c', 'd']) #可以将一个或多个列转换为行索引并返回
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [620]:
frame.set_index(['c', 'd'], drop=False) #列转换为行索引后不删除对应的列索引

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [621]:
frame2.reset_index() #将层次化索引的级别会转移到列里面

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 7.其他有关pandas的话题

### 7.1整数索引

In [622]:
ser = Series(np.arange(3.)) 
ser[-1]
#书上的例子，这里会出错

KeyError: -1

In [623]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [624]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [625]:
ser.iloc[:1]

0    0.0
dtype: float64

In [626]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [627]:
#ser3.iget_value(2)书上代码会出错
ser3.iloc[2]

2

In [628]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0] #书上代码会出错

0    0
1    1
Name: 2, dtype: int64

### 7.2面板数据

In [629]:
from pandas_datareader import DataReader #注意：此后代码与书上有区别
from datetime import datetime
all_data={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    #若无法获取数据，请将iex改为其他股票数据提供者
    all_data[ticker]=DataReader(ticker,'iex',datetime(2018,1,1),datetime(2018,9,1))
pdata=pd.Panel(all_data)
pdata

1y
1y
1y
1y

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 169 (major_axis) x 5 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2018-01-02 to 2018-08-31
Minor_axis axis: open to volume

In [630]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 169 (major_axis) x 5 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2018-01-02 to 2018-08-31
Minor_axis axis: open to volume

In [631]:
pdata.items

Index(['AAPL', 'GOOG', 'IBM', 'MSFT'], dtype='object')

In [632]:
pdata.major_axis

Index(['2018-01-02', '2018-01-03', '2018-01-04', '2018-01-05', '2018-01-08',
       '2018-01-09', '2018-01-10', '2018-01-11', '2018-01-12', '2018-01-16',
       ...
       '2018-08-20', '2018-08-21', '2018-08-22', '2018-08-23', '2018-08-24',
       '2018-08-27', '2018-08-28', '2018-08-29', '2018-08-30', '2018-08-31'],
      dtype='object', name='date', length=169)

In [633]:
pdata.minor_axis

Index(['open', 'high', 'low', 'close', 'volume'], dtype='object')

In [634]:
pdata['AAPL','2018-08-21','low']

214.025

In [635]:
stacked=pdata.loc[:,'2018-08-21':'2018-08-31',:].to_frame()
stacked

                           AAPL        GOOG           IBM          MSFT
date       minor
2018-08-21 open    2.168000e+02     1208.00  1.470000e+02  1.069200e+02
           high    2.171900e+02     1217.26  1.471200e+02  1.073500e+02
           low     2.140250e+02     1200.35  1.458900e+02  1.058500e+02
           close   2.150400e+02     1201.62  1.459700e+02  1.059800e+02
           volume  2.615976e+07  1205580.00  3.106876e+06  2.288186e+07
2018-08-22 open    2.141000e+02     1200.00  1.460100e+02  1.058500e+02
           high    2.163600e+02     1211.84  1.461600e+02  1.073400e+02
           low     2.138400e+02     1199.00  1.451900e+02  1.057800e+02
           close   2.150500e+02     1207.33  1.452400e+02  1.070600e+02
           volume  1.901813e+07   887389.00  2.388961e+06  1.800064e+07
2018-08-23 open    2.146500e+02     1207.14  1.450400e+02  1.071500e+02
           high    2.170500e+02     1221.28  1.455200e+02  1.081800e+02
           low     2.146000e+02     1204.24  1.447500e+02  1.068700e+02
           close   2.154900e+02     1205.38  1.453700e+02  1.075600e+02
           volume  1.888322e+07   992604.00  2.220603e+06  1.816772e+07
2018-08-24 open    2.166000e+02     1208.82  1.454600e+02  1.076700e+02
           high    2.169000e+02     1221.65  1.460869e+02  1.085600e+02
           low     2.151100e+02     1206.36  1.448700e+02  1.075600e+02
           close   2.161600e+02     1220.65  1.460400e+02  1.084000e+02
           volume  1.847636e+07   946840.00  2.776813e+06  1.723402e+07
2018-08-27 open    2.171500e+02     1227.60  1.469400e+02  1.092700e+02
           high    2.187400e+02     1243.09  1.476200e+02  1.096400e+02
           low     2.163300e+02     1225.72  1.465200e+02  1.085100e+02
           close   2.179400e+02     1241.82  1.466900e+02  1.096000e+02
           volume  2.052512e+07  1156255.00  3.491565e+06  1.966233e+07
2018-08-28 open    2.190100e+02     1241.29  1.469500e+02  1.099400e+02
           high    2.205400e+02     1242.55  1.469900e+02  1.105000e+02
           low     2.189200e+02     1228.69  1.461900e+02  1.097900e+02
           close   2.197000e+02     1231.15  1.465900e+02  1.102600e+02
           volume  2.277677e+07  1304007.00  2.455328e+06  1.915153e+07
2018-08-29 open    2.201500e+02     1237.45  1.468700e+02  1.104500e+02
           high    2.234900e+02     1250.66  1.479300e+02  1.120300e+02
           low     2.194100e+02     1236.36  1.466000e+02  1.102700e+02
           close   2.229800e+02     1249.30  1.475400e+02  1.120200e+02
           volume  2.725480e+07  1309312.00  3.153845e+06  2.081804e+07
2018-08-30 open    2.232500e+02     1244.23  1.470300e+02  1.116700e+02
           high    2.282600e+02     1253.63  1.473000e+02  1.126100e+02
           low     2.224000e+02     1232.59  1.452500e+02  1.114400e+02
           close   2.250300e+02     1239.12  1.459300e+02  1.119500e+02
           volume  4.879382e+07  1331439.00  3.340369e+06  2.279870e+07
2018-08-31 open    2.265100e+02     1234.98  1.457200e+02  1.116850e+02
           high    2.288700e+02     1238.66  1.467800e+02  1.127770e+02
           low     2.260000e+02     1211.29  1.455401e+02  1.115150e+02
           close   2.276300e+02     1218.19  1.464800e+02  1.123300e+02
           volume  4.334013e+07  1816426.00  3.488476e+06  2.322271e+07

In [636]:
stacked.to_panel()

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 9 (major_axis) x 5 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2018-08-21 to 2018-08-31
Minor_axis axis: open to volume